In [2]:
import pandas as pd

In [3]:
df = pd.read_excel('default_of_credit_card_clients.xls')

In [4]:
import numpy as np

In [5]:
np.random.seed(seed=24)

In [6]:
random_integers = np.random.randint(low=1,high=5,size=100)

In [7]:
is_equal_to_3 = random_integers == 3

In [8]:
is_equal_to_3[:5]

array([ True, False, False, False, False])

In [9]:
sum(is_equal_to_3)

22

In [10]:
random_integers[is_equal_to_3]

array([3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3])

In [11]:
id_counts = df['ID'].value_counts()
dupe_mask = id_counts == 2
dupe_mask[0:5]

2458b96d-e8f1    True
8f9549b7-d5a4    True
9389d6e1-e1a7    True
8567249b-827e    True
61ae560c-4479    True
Name: ID, dtype: bool

In [12]:
dupe_ids = id_counts.index[dupe_mask]
dupe_ids = list(dupe_ids)
len(dupe_ids)

313

In [13]:
df.loc[df['ID'].isin(dupe_ids[0:3]),:].head(10)

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_1,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
6471,9389d6e1-e1a7,500000,2,2,2,48,-1,-1,-1,-1,...,9536,8302,64460,68781,58436,9536,58302,64460,14000,0
6571,9389d6e1-e1a7,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
18477,2458b96d-e8f1,60000,2,2,2,25,-1,-1,0,0,...,6682,6223,7007,7353,2007,2011,2005,3003,3005,0
18577,2458b96d-e8f1,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
28834,8f9549b7-d5a4,220000,2,1,2,36,0,0,0,0,...,221193,181859,184605,10000,8018,10121,6006,10987,143779,1
28934,8f9549b7-d5a4,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [14]:
df_zero_mask = df == 0

In [15]:
feature_zero_mask = df_zero_mask.iloc[:,1:].all(axis=1)
sum(feature_zero_mask)

315

In [16]:
df_clean_1 = df.loc[~feature_zero_mask,:].copy()

In [17]:
df_clean_1['ID'].nunique()

29685

In [18]:
valid_pay_1_mask = df_clean_1['PAY_1'] != 'Not available'
valid_pay_1_mask[0:5]

0    True
1    True
2    True
3    True
4    True
Name: PAY_1, dtype: bool

In [19]:
df_clean_2 = df_clean_1.loc[valid_pay_1_mask,:].copy()

In [20]:
df_clean_2['PAY_1'] = df_clean_2['PAY_1'].astype('int64')
df_clean_2[['PAY_1', 'PAY_2']].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 26664 entries, 0 to 29999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   PAY_1   26664 non-null  int64
 1   PAY_2   26664 non-null  int64
dtypes: int64(2)
memory usage: 624.9 KB

In [21]:
df_clean_2['EDUCATION'].replace(to_replace=[0, 5, 6], value=4, inplace=True)
df_clean_2['EDUCATION'].value_counts()

2    12458
1     9412
3     4380
4      414
Name: EDUCATION, dtype: int64

In [22]:
df_clean_2['MARRIAGE'].replace(to_replace=0, value=3, inplace=True)
df_clean_2['MARRIAGE'].value_counts()

2    14158
1    12172
3      334
Name: MARRIAGE, dtype: int64

In [23]:
df_clean_2['EDUCATION_CAT'] = 'none'

In [24]:
df_clean_2[['EDUCATION', 'EDUCATION_CAT']].head(10)

   EDUCATION EDUCATION_CAT
0          2          none
1          2          none
2          2          none
3          2          none
4          2          none
5          1          none
6          1          none
7          2          none
8          3          none
9          3          none

In [25]:
cat_mapping = {
    1: "graduate school",
    2: "university",
    3: "high school",
    4: "others"
}

In [26]:
df_clean_2['EDUCATION_CAT'] = df_clean_2['EDUCATION'].map(cat_mapping)
df_clean_2[['EDUCATION', 'EDUCATION_CAT']].head(10)

   EDUCATION    EDUCATION_CAT
0          2       university
1          2       university
2          2       university
3          2       university
4          2       university
5          1  graduate school
6          1  graduate school
7          2       university
8          3      high school
9          3      high school

In [27]:
edu_ohe = pd.get_dummies(df_clean_2['EDUCATION_CAT'])
edu_ohe.head(10)
df_with_ohe = pd.concat([df_clean_2, edu_ohe], axis=1)
df_with_ohe[['EDUCATION_CAT', 'graduate school',
             'high school', 'university', 'others']].head(10)
print(df_with_ohe)
df_with_ohe.to_csv('cleaned_data.csv', index=False)

                  ID  LIMIT_BAL  SEX  EDUCATION  MARRIAGE  AGE  PAY_1  PAY_2  \
0      798fc410-45c1      20000    2          2         1   24      2      2
1      8a8c8f3b-8eb4     120000    2          2         2   26     -1      2
2      85698822-43f5      90000    2          2         2   34      0      0
3      0737c11b-be42      50000    2          2         1   37      0      0
4      3b7f77cc-dbc0      50000    1          2         1   57     -1      0
...              ...        ...  ...        ...       ...  ...    ...    ...
29995  ecff42d0-bdc6     220000    1          3         1   39      0      0
29996  99d1fa0e-222b     150000    1          3         2   43     -1     -1
29997  95cdd3e7-4f24      30000    1          2         2   37      4      3
29998  00d03f02-04cd      80000    1          3         1   41      1     -1
29999  15d69f9f-5ad3      50000    1          2         1   46      0      0

       PAY_3  PAY_4  ...  PAY_AMT3  PAY_AMT4  PAY_AMT5  PAY_AMT6  \
0         -1     -1  ...         0         0         0         0
1          0      0  ...      1000      1000         0      2000
2          0      0  ...      1000      1000      1000      5000
3          0      0  ...      1200      1100      1069      1000
4         -1      0  ...     10000      9000       689       679
...      ...    ...  ...       ...       ...       ...       ...
29995      0      0  ...      5003      3047      5000      1000
29996     -1     -1  ...      8998       129         0         0
29997      2     -1  ...     22000      4200      2000      3100
29998      0      0  ...      1178      1926     52964      1804
29999      0      0  ...      1430      1000      1000      1000

       default payment next month  EDUCATION_CAT  graduate school  \
0                               1     university                0
1                               1     university                0
2                               0     university                0
3                               0     university                0
4                               0     university                0
...                           ...            ...              ...
29995                           0    high school                0
29996                           0    high school                0
29997                           1     university                0
29998                           1    high school                0
29999                           1     university                0

       high school  others  university
0                0       0           1
1                0       0           1
2                0       0           1
3                0       0           1
4                0       0           1
...            ...     ...         ...
29995            1       0           0
29996            1       0           0
29997            0       0           1
29998            1       0           0
29999            0       0           1

[26664 rows x 30 columns]